{
  "content": [
    "Harshmanpreet Singh",
    "Edmonton, AB | P: +1 7804460505 |    harshman@ualberta.ca",
    "EDUCATION",
    "UNIVERSITY OF ALBERTA        Edmonton, AB",
    "Bachelor of Science        Expected June 2026",
    "Major in Computer Science.",
    "Cumulative GPA: 3.68/4.0;",
    "Technical Tools:  HTML/CSS, JavaScript/TypeScript (React/Angular/Vue), Node.js, Python (Django/Flask/FastAPI), Java, C# (ASP.NET Core), PHP (Laravel), Go, SQL/NoSQL databases, Docker and cloud platforms (AWS/Azure/GCP) and Agile project management using Jira.",
    "WORK EXPERIENCE",
    "WFS. Transport LTD.\t        Milton, ON",
    "Data Analyst Intern.       \t\t\tMay 2023 – Jan 2024",
    "As an Intern Data Analyst at WFS Transport ltd, a prominent trucking company, I played a pivotal role in leveraging data-driven insights to enhance operational efficiency and drive strategic decision-making.",
    "With a strong foundation in data analysis and a proficiency in Python and various statistical tools, I excelled in extracting actionable information from complex datasets and presenting it in a meaningful format. I learned alot from the company’s founder Mr. Dave Walia, who has been operating the company since the last 17 years of its founding.",
    "Disney Streaming                          New York, NY.",
    "Data Engineer     \t\t\t \tSept 2024 – Feb 2025",
    "Led end-to-end data migration efforts by coordinating with cross-functional teams to plan, execute, and validate seamless transitions across internal systems.",
    "Ensured data integrity and consistency by developing automated ETL validation scripts and performing rigorous QA testing.",
    "Diagnosed and resolved system performance issues post-migration, achieving a 30% improvement in data pipeline efficiency.",
    "Created and maintained comprehensive technical documentation to support onboarding, scalability, and future migrations. Contributed to scalability planning by profiling data workflows and recommending architectural optimizations.",
    "UNIVERSITY PROJECTS",
    "WHIMSY - Social Media Application.        \t\t\t   Feb 2025",
    "Developed a social media platform enabling users to share short-form \"moods\" and engage with others. Leveraged Firebase for authentication and data storage.",
    "﻿﻿Follow/Following Feature: Built user follow relationships, allowing real-time updates on new posts.",
    "﻿﻿Al-Driven Image Generation: Integrated DALL•E for mood-based image creation..",
    "﻿﻿Al-Powered Responses: Added automatic mood explanations using the #generate-response hashtag.",
    "﻿﻿Suggested Users: Implemented recommendation logic that suggests accounts to follow based on existing follow relationships.",
    "﻿﻿User Interactions: Enabled user tagging, profile editing, and robust sign-in/sign-up flows for a seamless user experience.",
    "Tech Stack: Firebase, Java, XML,  Kotlin, DALL•E.",
    "FORMULA 1 Race Outcome Predictor & Analytics Dashboard       Mar 2025",
    "Developed an end-to-end predictive model to forecast Grand Prix wins using data from FastF1 API, incorporating driver performance, team dynamics, and track-specific features.",
    "Engineered advanced features such as average lap times, teammate performance deltas, grid position impact, and normalized season progress metrics to overcome differences in race calendar structure.",
    "Implemented model interpretability using SHAP analysis to provide clear insights into key factors influencing race outcomes.Addressed data imbalance and ensured robust predictions by calibrating the model with threshold tuning and class weighting in LightGBM.",
    "Deployed an interactive Streamlit dashboard for real-time exploration, including visualizations of win probabilities, driver consistency across circuits, and team win rate breakdowns.Improved data quality by integrating imputation techniques for missing team-level features, resulting in a model with enhanced accuracy and reliability for elite drivers.",
    "Tech stack: Python, Pandas, Numpy, LightGBM, Scikit-Learn, SHAP, FastF1 API, Streamlit, Matpotlib, Seaborn.",
    "ADDITIONAL",
    "Certifications & Training: AWS Certified Solutions Architect - Associate, Google Cloud Associate Cloud Engineer,"
  ]
}